app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists"
---
  def index
    @list = List.new
    @lists = List.all

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    @list = List.find(params[:id])

INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "hi"], ["created_at", "2016-03-16 15:45:43.989853"], ["updated_at", "2016-03-16 15:45:43.989853"]]
---
  def create
    @list = List.new(list_params)
    @list.name = params[:list][:name]
    @list.save